In [2]:
import pandas as pd
import numpy as np
data = {
    'Id': ['H-20','B-30','E-40','M-90','D-50','A-60','F-70','L-80','K-90'],
    'Name': ['Alice', 'Bob', 'Charlie','Bob', np.nan,'Anny', 'Bobby', 'Charter',  np.nan],
    'Age': [24, 27,  np.nan,89, 32, 45, 33, 44,  np.nan],
    'City': [ np.nan, 'Los Angeles', 'Chicago', 'Singapore','Houston','Japan','China','Singapore', np.nan]
}
df = pd.DataFrame(data)
df

     Id     Name   Age         City
0  H-20    Alice  24.0          NaN
1  B-30      Bob  27.0  Los Angeles
2  E-40  Charlie   NaN      Chicago
3  M-90      Bob  89.0    Singapore
4  D-50      NaN  32.0      Houston
5  A-60     Anny  45.0        Japan
6  F-70    Bobby  33.0        China
7  L-80  Charter  44.0    Singapore
8  K-90      NaN   NaN          NaN

In [10]:
# boolean mask data
df['Name'] == 'Bob'

0    False
1     True
2    False
3     True
4    False
5    False
6    False
7    False
8    False
Name: Name, dtype: bool

In [16]:
#filter data belongs to 'Bob'
df[df['Name'] == 'Bob']

     Id Name   Age         City
1  B-30  Bob  27.0  Los Angeles
3  M-90  Bob  89.0    Singapore

In [20]:
#filter data whose age is greater than 33
df[df['Age'] >33]

     Id     Name   Age       City
3  M-90      Bob  89.0  Singapore
5  A-60     Anny  45.0      Japan
7  L-80  Charter  44.0  Singapore

In [26]:
# filter based on multiple condition using &
a = df['Age'] >33
b = df['Name'] == 'Bob'
df[a & b]

     Id Name   Age       City
3  M-90  Bob  89.0  Singapore

In [28]:
# filter based on multiple condition using |
a = df['Age'] >33
b = df['Name'] == 'Bob'
df[a | b]

     Id     Name   Age         City
1  B-30      Bob  27.0  Los Angeles
3  M-90      Bob  89.0    Singapore
5  A-60     Anny  45.0        Japan
7  L-80  Charter  44.0    Singapore

In [32]:
# filter based on multiple condition using | and &
a = df['Age'] >33
b = df['Name'] == 'Bob'
c = df['City'] == 'Singapore'
df[(a|b)& c]

     Id     Name   Age       City
3  M-90      Bob  89.0  Singapore
7  L-80  Charter  44.0  Singapore